return {
  ["syr-2"] = {
[[
܏ 1 2 3 4 5 6 7 8 9 0 - = 
 ܩ ܘ ܖ ܪ ܬ ܝ ܜ ܥ ܧ ܦ ] [ ܆
ܐ ܣ ܕ ܔ ܓ ܗ ܛ ܟ ܠ ܚ ܞ 
 ܆ ܙ ܨ ܤ ܫ ܒ ܢ ܡ ܀ . / 
]],[[
̮ ! ̊ ̥ ݉ ♰ ♱ ܊ » ) ( « + 
 ܰ ܳ ܶ ܺ ܽ ݀ ݁ ̈ ̄ ̇ ̃ ݊ :
ܱ ܴ ܷ ܻ ܾ ܑ ـ ̤ ̱ ̣ ̰ 
 : ܲ ܵ ܸ ܼ ܿ ܹ ݂ ، ؛ / 
]],[[
ّ ܁ ܂ ܃ ܄ ܅ ܈ ܉ ܋ ܌ ܍ ┌ ┐ 
 َ ً ُ ٌ ٓ ٔ ݇ ݃ ݅ ̭   
ِ ٍ  ء ٕ ٰ ݈ ݄ ݆   
   ْ         
]],
nil, 
},["is"] = {
[[
° 1 2 3 4 5 6 7 8 9 0 ö - 
 q w e r t y u i o p ð '
a s d f g h j k l æ ´ + 
 < z x c v b n m , . þ 
]],[[
¨ ! " # $ % & / ( ) = Ö _ 
 Q W E R T Y U I O P Ð ?
A S D F G H J K L Æ ' * 
 > Z X C V B N M ; : Þ 
]],[[
°     €  { [ ] } \  
 @  €         ~
          ^ ` 
 |       µ    
]],
nil, 
},["ar-2"] = {
[[
> 1 2 3 4 5 6 7 8 9 0 - = 
 ض ص ث ق ف غ ع ه خ ح ج د 
ش س ي ب ل ا ت ن م ك ط ذ 
 ـ ئ ء ؤ ر لا ى ة و ز ظ 
]],[[
< ! @ # $ % ^ & * ) ( _ + 
 َ ً ُ ٌ لإ إ ‘ ÷ × ؛ } { 
\  ] [ لأ أ ـ ، / : "" ّ 
 | ~ ْ ِ ٍ لآ آ ’ , . ؟ 
]],[[
    ¤         
 َّ ًّ ُّ ٌّ         
            
    ِّ ٍّ       
]],
nil, 
},["ug-2"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 چ ۋ ې ر ت ي ۇ ڭ و پ ] [ \
ھ س د ا ە ى ق ك ل ؛ ' 
 ز ش غ ۈ ب ن م ، . / 
]],[[
~ ! @ # $ % ^ & * ) ( _ + 
           » « |
  ژ ڧ گ خ ج ۆ لا : " 
        > < / 
]],
nil, 
nil, 
},["el-7"] = {
[[
~ 1 2 3 4 5 6 7 8 9 0 - = 
 ; ς ε ρ τ υ θ ι ο π [ ]
α σ δ φ γ η ξ κ λ ΄ ' \ 
 ζ χ ψ ω β ν μ , . / 
]],[[
` ! @ # $ % ^ & * ( ) _ + 
 : ΅ Ε Ρ Τ Υ Θ Ι Ο Π { }
Α Σ Δ Φ Γ Η Ξ Κ Λ ¨ " | 
 Ζ Χ Ψ Ω Β Ν Μ < > ? 
]],[[
῁ Ϛ Ϟ Ϡ £ § ¶  ¤ ¦ ° ± ½ 
 ´  € ®  ¥     « »
         ΅ ᾿ ¬ 
   ©       ι 
]],[[
  ² ³         ῟ 
            ·
          ῾ ῝ 
          ῞ 
]],
},["ps"] = {
[[
 ۱ ۲ ۳ ۴ ۵ ۶ ۷ ۸ ۹ ۰ - = 
 ض ص ث ق ف غ ع ه خ ح ج چ \
ش س ی ب ل ا ت ن م ک ګ 
 ظ ط ز ر ذ د ړ و ږ / 
]],[[
ٔ ! ٬ ٫ ؋ ٪ × » « ) ( ـ + 
 ْ ٌ ٍ ً ُ ِ َ ّ ځ څ ] [ *
ښ ۍ ي پ أ آ ټ ڼ ة : ؛ 
 ئ ې ژ ء  ډ ؤ ، . / 
]],[[
` ~ @ # $ % ^ & ٭ • ° _ ÷ 
 € ٱ ى   ٓ ٙ ٰ ' " } { |
  ے ں ڷ إ ٹ > < ك گ 
 ? ;    ڈ ڑ , ۇ  
]],
nil, 
},["ro-2"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] \
a s d f g h j k l ; ' 
 \ z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } |
A S D F G H J K L : " 
 | Z X C V B N M < > / 
]],[[
 ~ ˇ ^ ˘ ° ˛ ` ˙ ´ ˝ ¨ ¸ 
 â ß €  ț   î  § „ ” 
ă ș đ      ł   
    ©     « »  
]],[[
           – ± 
 Â    Ț   Î     
Ă Ș Đ      Ł   
            
]],
},["tr"] = {
[[
+ 1 2 3 4 5 6 7 8 9 0 / - 
 f g ğ ı o d r n h p q w
u i e a ü t k m l y ş x 
 < j ö v c ç z s b . , 
]],[[
* ! " ^ $ % & ' ( ) = ? _ 
 F G Ğ I O D R N H P Q '
U İ E A Ü T K M L Y Ş X 
 > J Ö V C Ç Z S B : ; 
]],[[
¬ ¹ ² # ¼ ½ ¾ { [ ] } \ | 
 @   ¶  ¥   ø £ ¨ ~
æ ß €       ´  ` 
 | « » ¢    µ × ÷ ­ 
]],[[
 ¡  ³ ¤       ¿  
    ®     Ø   
Æ §  ª         
 ¦ < > ©    º    
]],
},["ur"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 ط ص ھ د ٹ پ ت ب ج ح ] [ \
م و ر ن ل ہ ا ک ی ؛ ' 
 \ ق ف ے س ش غ ع ، ۔ / 
]],[[
~ ! @ # $ ٪ ^ ۖ ٭ ) ( _ + 
 ظ ض ذ ڈ ث ّ ۃ ـ چ خ } { |
ژ ز ڑ ں ۂ ء آ گ ي : " 
 |   ۓ  ؤ ئ  > < / 
]],
nil, 
nil, 
},["no-2"] = {
[[
| 1 2 3 4 5 6 7 8 9 0 + \ 
 q w e r t y u i o p å ¨ '
a s d f g h j k l ø æ 
 < z x c v b n m , . / 
]],[[
§ ! " # ¤ % & / ( ) = ? ` 
 Q W E R T Y U I O P Å ^ *
A S D F G H J K L Ø Æ 
 > Z X C V B N M ; : / 
]],[[
  @ £ $ €  { [ ] }  ´ 
 â  €  ŧ   ï õ   ~ 
á š đ ǥ ǧ ȟ  ǩ  ö ä 
  ž  č ǯ ʒ ŋ µ    
]],[[
             
 Â    Ŧ   Ï Õ    
Á Š Đ Ǥ Ǧ Ȟ  Ǩ  Ö Ä 
  Ž  Č Ǯ Ʒ Ŋ     
]],
},["sk"] = {
[[
; + ľ š č ť ž ý á í é = ´ 
 q w e r t z u i o p ú ä ň
a s d f g h j k l ô § 
 & y x c v b n m , . / 
]],[[
° 1 2 3 4 5 6 7 8 9 0 % ˇ 
 Q W E R T Z U I O P / ( )
A S D F G H J K L " ! 
 * Y X C V B N M ? : / 
]],[[
 ~ ˇ ^ ˘ ° ˛ ` ˙ ´ ˝ ¨ ¸ 
 \ | €       ' ÷ × ¤
 đ Đ [ ]   ł Ł $ ß 
 < > # & @ { }  < >  
]],
nil, 
},["uk"] = {
[[
ё 1 2 3 4 5 6 7 8 9 0 - = 
 й ц у к е н г ш щ з х ї \
ф і в а п р о л д ж є 
 ґ я ч с м и т ь б ю / 
]],[[
Ё ! " № ; % : ? * ( ) _ + 
 Й Ц У К Е Н Г Ш Щ З Х Ї /
Ф І В А П Р О Л Д Ж Є 
 Ґ Я Ч С М И Т Ь Б Ю / 
]],[[
             
       ґ      
           
            
]],[[
             
       Ґ      
           
            
]],
},["tk"] = {
[[
ž 1 2 3 4 5 6 7 8 9 0 - = 
 ä w e r t y u i o p ň ö ş
a s d f g h j k l ; ' 
 \ z ü ç ý b n m , . / 
]],[[
Ž ! @ # $ % № & * ( ) _ + 
 Ä W E R T Y U I O P Ň Ö Ş
A S D F G H J K L : " 
 | Z Ü Ç Ý B N M < > / 
]],
nil, 
nil, 
},["el-5"] = {
[[
\ 1 2 3 4 5 6 7 8 9 0 ' + 
 q w e r t y u i o p [ ]
a s d f g h j k l ´ ^ ` 
 < z x c v b n m , . - 
]],[[
| ! " # $ % & / ( ) = ? * 
 Q W E R T Y U I O P { }
A S D F G H J K L ¨ ~ @ 
 > Z X C V B N M ; : _ 
]],[[
             
   €         
            
            
]],
nil, 
},["uz"] = {
[[
ё 1 2 3 4 5 6 7 8 9 0 ғ ҳ 
 й ц у к е н г ш ў з х ъ \
ф қ в а п р о л д ж э 
 \ я ч с м и т ь б ю / 
]],[[
Ё ! " № ; % : ? * ( ) Ғ Ҳ 
 Й Ц У К Е Н Г Ш Ў З Х Ъ /
Ф Қ В А П Р О Л Д Ж Э 
 / Я Ч С М И Т Ь Б Ю / 
]],
nil, 
nil, 
},["as"] = {
[[
॥ ১ ২ ৩ ৪ ৫ ৬ ৭ ৮ ৯ ০ - ৃ 
 ৌ ৈ া ী ূ ব হ গ দ জ ড ় 
ো ে ্ ি ু প ৰ ক ত চ ট 
   ং ম ন ৱ ল স , . / 
]],[[
 ! @ ্ৰ ৰ্ জ্ঞ ত্ৰ ক্ষ শ্ৰ ( ) ঃ ঋ 
 ঔ ঐ আ ঈ ঊ ভ ঙ ঘ ধ ঝ ঢ ঞ 
ও এ অ ই উ ফ  খ থ ছ ঠ 
   ঁ ণ    শ ষ । / 
]],[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] \
a s d f g h j k l ; ' 
 z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } |
A S D F G H J K L : " 
 Z X C V B N M < > ? 
]],
},["mk"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 љ њ е р т ѕ у и о п ш ѓ ж
а с д ф г х ј к л ч ќ 
 ё з џ ц в б н м , . / 
]],[[
~ ! „ “ ’ % ‘ & * ( ) _ + 
 Љ Њ Е Р Т Ѕ У И О П Ш Ѓ Ж
А С Д Ф Г Х Ј К Л Ч Ќ 
 Ё З Џ Ц В Б Н М ; : / 
]],[[
             
   €        Ђ ђ 
   [ ]     Ћ ћ 
     @ { } §    
]],
nil, 
},["el-3"] = {
[[
\ 1 2 3 4 5 6 7 8 9 0 ' ] 
 q w e r t y u i o p + }
a s d f g h j k l ΄ ¨ # 
 < z x c v b n m , . - 
]],[[
| ! " # $ % & / ( ) = ? [ 
 Q W E R T Y U I O P * {
A S D F G H J K L ¨ ΅ @ 
 > Z X C V B N M ; : _ 
]],[[
  ² ³ £ § ¶  ¤ ¦ ° ± ½ 
   €        « »
         ΅ ΅ ¬ 
            
]],
nil, 
},["wen-2"] = {
[[
^ 1 2 3 4 5 6 7 8 9 0 ß ´ 
 q w e r t z u i o p ü + ł
a s d f g h j k l ö ä 
 < y x c v b n m , . / 
]],[[
° ! " § $ % & / ( ) = ? ` 
 Q W E R T Z U I O P Ü * Ł
A S D F G H J K L Ö Ä 
 > Y X C V B N M ; : / 
]],[[
 » « „ ‚ ‘ “ { [ ] } \  
 @  €         ~ #
           
 |           
]],
nil, 
},["fr"] = {
[[
² & é " ' ( - è _ ç à ) = 
 a z e r t y u i o p ^ $
q s d f g h j k l m ù * 
 < w x c v b n , ; : ! 
]],[[
 1 2 3 4 5 6 7 8 9 0 ° + 
 A Z E R T Y U I O P ¨ £
Q S D F G H J K L M % µ 
 > W X C V B N ? . / § 
]],[[
  ~ # { [ | ` \ ^ @ ] } 
   €         ¤
            
            
]],
nil, 
},["mr"] = {
[[
 १ २ ३ ४ ५ ६ ७ ८ ९ ० - ृ 
 ौ ै ा ी ू ब ह ग द ज ड ़ ॉ
ो े ् ि ु प र क त च ट 
 ॉ ं म न व ल स , . / 
]],[[
 ऍ ॅ ्र र् ज्ञ त्र क्ष श्र ( ) ः ऋ 
 औ ऐ आ ई ऊ भ ङ घ ध झ ढ ञ ऑ
ओ ए अ इ उ फ ऱ ख थ छ ठ 
 ऑ ँ ण   ळ श ष । / 
]],[[
` 1 2 3 4 5 6 7 8 9 0 - = 
           [ ] \
         ; ' 
        , .  
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
           { } |
         : " 
  ऽ ॐ     < >  
]],
},["or"] = {
[[
1 2 3 4 5 6 7 8 9 0 0 ୃ 
 ୌ ୈ ା ୀ ୂ ବ ହ ଗ ଦ ଜ ଡ ଼
ୋ େ ୍ ି ୁ ପ ର କ ତ ଚ ଟ 
 ୟ ଂ ମ ନ ବ ଲ ସ , . / 
]],[[
  ୍ର ର୍ ଜ୍ଞ ତ୍ର କ୍ଷ ଶ୍ର ( ) ଃ ଋ 
 ଔ ଐ ଆ ଈ ଊ ଭ ଙ ଘ ଧ ଝ ଢ ଞ
ଓ ଏ ଅ ଇ ଉ ଫ  ଖ ଥ ଛ ଠ 
 ୱ ଁ ଣ   ଳ ଶ ଷ  / 
]],[[
୧ ୨ ୩ ୪ ୫ ୬ ୭ ୮ ୯ ୦   
           ଡ଼ 
           
           
]],[[
           ୠ 
    ୡ       ଢ଼ 
   ଌ        
         ଽ  
]],
},["sr"] = {
[[
‚ 1 2 3 4 5 6 7 8 9 0 ' + 
 q w e r t z u i o p š đ ž
a s d f g h j k l č ć 
 < y x c v b n m , . / 
]],[[
~ ! " # $ % & / ( ) = ? * 
 Q W E R T Z U I O P Š Đ Ž
A S D F G H J K L Č Ć 
 > Y X C V B N M ; : / 
]],[[
 ~ ˇ ^ ˘ ° ˛ ` ˙ ´ ˝ ¨ ¸ 
 \ | €        ÷ × ¤
   [ ]   ł Ł  ß 
     @ { } § < >  
]],
nil, 
},["lb"] = {
[[
§ 1 2 3 4 5 6 7 8 9 0 ' ^ 
 q w e r t z u i o p è ¨ $
a s d f g h j k l é à 
 < y x c v b n m , . / 
]],[[
° + " * ç % & / ( ) = ? ` 
 Q W E R T Z U I O P ü ! £
A S D F G H J K L ö ä 
 > Y X C V B N M ; : / 
]],[[
 ¦ @ # ° § ¬ | ¢   ´ ~ 
   €        [ ] }
          { 
 \           
]],
nil, 
},["zh-2"] = {
[[
€ 1 2 3 4 5 6 7 8 9 0 - = 
 手 田 水 口 廿 卜 山 戈 人 心 [ ] \
日 尸 木 火 土 竹 十 大 中 ; ' 
Ｚ 難 金 女 月 弓 一 , . /
]],
nil, [[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] \
a s d f g h j k l ; ' 
 z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } |
A S D F G H J K L : " 
 Z X C V B N M < > ? 
]],
},["az"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 ј ү у к е н г ш һ з х ҹ \
ф ы в а п р о л д ж ҝ 
 \ ә ч с м и т ғ б ө / 
]],[[
~ ! " № ; % : ? * ( ) _ + 
 Ј Ү У К Е Н Г Ш Һ З Х Ҹ /
Ф Ы В А П Р О Л Д Ж Ҝ 
 | Ә Ч С М И Т Ғ Б Ө / 
]],
nil, 
nil, 
},["bg-2"] = {
[[
ю 1 2 3 4 5 6 7 8 9 0 - = 
 ч ш е р т ъ у и о п я щ ь
а с д ф г х й к л ; ' 
 ѝ з ж ц в б н м , . / 
]],[[
Ю ! @ № $ % € § * ( ) – + 
 Ч Ш Е Р Т Ъ У И О П Я Щ ѝ
А С Д Ф Г Х Й К Л : " 
 Ѝ З Ж Ц В Б Н М „ “ / 
]],
nil, 
nil, 
},["ar"] = {
[[
ذ 1 2 3 4 5 6 7 8 9 0 - = 
 ض ص ث ق ف غ ع ه خ ح ج د \
ش س ي ب ل ا ت ن م ك ط 
 ئ ء ؤ ر لا ى ة و ز ظ 
]],[[
ّ ! @ # $ % ^ & * ) ( _ + 
 َ ً ُ ٌ لإ إ ‘ ÷ × ؛ < > |
ِ ٍ ] [ لأ أ ـ ، / : " 
 ~ ْ } { لآ آ ’ , . ؟ 
]],
nil, 
nil, 
},["hy-e"] = {
[[
՝ : ձ յ ՛ , - . « » օ ռ ժ 
 խ ւ է ր տ ե ը ի ո պ չ ջ '
ա ս դ ֆ ք հ ճ կ լ թ փ 
 ' զ ց գ վ բ ն մ շ ղ / 
]],[[
՜ 1 Ձ Յ 3 4 9 և ( ) Օ Ռ Ժ 
 Խ Ւ Է Ր Տ Ե Ը Ի Ո Պ Չ Ջ ՞
Ա Ս Դ Ֆ Ք Հ Ճ Կ Լ Թ Փ 
 ՞ Զ Ց Գ Վ Բ Ն Մ Շ Ղ / 
]],
nil, 
nil, 
},["ky"] = {
[[
ё 1 2 3 4 5 6 7 8 9 0 - = 
 й ц у к е н г ш щ з х ъ \
ф ы в а п р о л д ж э 
 \ я ч с м и т ь б ю / 
]],[[
Ё ! " № ; % : ? * ( ) _ + 
 Й Ц У К Е Н Г Ш Щ З Х Ъ /
Ф Ы В А П Р О Л Д Ж Э 
 / Я Ч С М И Т Ь Б Ю / 
]],[[
             
   ү   ң       
      ө     
            
]],[[
             
   Ү   Ң       
      Ө     
            
]],
},["ba"] = {
[[
ә ! ө ҡ ғ ҫ : ҙ һ ? № - ү 
 й ц у к е н г ш щ з х ъ ң
ф ы в а п р о л д ж э 
 я ч с м и т ь б ю / 
]],[[
Ә " Ө Ҡ Ғ Ҫ ; Ҙ Һ ( ) % Ү 
 Й Ц У К Е Н Г Ш Щ З Х Ъ Ң
Ф Ы В А П Р О Л Д Ж Э 
 Я Ч С М И Т Ь Б Ю / 
]],
nil, 
nil, 
},["el-4"] = {
[[
½ 1 2 3 4 5 6 7 8 9 0 ' + 
 · ς ε ρ τ υ θ ι ο π [ ]
α σ δ φ γ η ξ κ λ ΄ ’ ² 
 § ζ χ ψ ω β ν μ , . - 
]],[[
± ! " £ $ % ¬ / ( ) = ° * 
 ― ¦ Ε Ρ Τ Υ Θ Ι Ο Π « »
Α Σ Δ Φ Γ Η Ξ Κ Λ ¨ ‘ ³ 
 © Ζ Χ Ψ Ω Β Ν Μ ; : _ 
]],[[
             
   €         
         ΅   
            
]],
nil, 
},["fa"] = {
[[
÷ 1 2 3 4 5 6 7 8 9 0 - = 
 ض ص ث ق ف غ ع ه خ ح ج چ پ
ش س ی ب ل ا ت ن م ک گ 
 پ ظ ط ز ر ذ د ئ و . / 
]],[[
× ! @ # $ % ^ & * ) ( _ + 
 ً ٌ ٍ ريال ، ؛ , ] [ \ } { |
َ ُ ِ ّ ۀ آ ـ « » : " 
 | ة ي ژ ؤ إ أ ء < > / 
]],
nil, 
nil, 
},["zh"] = {
[[
€ ㄅ ㄉ ˇ ˋ ㄓ ˊ ˙ ㄚ ㄞ ㄢ ㄦ = 
 ㄆ ㄊ ㄍ ㄐ ㄔ ㄗ ㄧ ㄛ ㄟ ㄣ [ ] \
ㄇ ㄋ ㄎ ㄑ ㄕ ㄘ ㄨ ㄜ ㄠ ㄤ ' 
ㄈ ㄌ ㄏ ㄒ ㄖ ㄙ ㄩ ㄝ ㄡ ㄥ
]],
nil, [[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] \
a s d f g h j k l ; ' 
 z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } |
A S D F G H J K L : " 
 Z X C V B N M < > ? 
]],
},["da"] = {
[[
½ 1 2 3 4 5 6 7 8 9 0 + ´ 
 q w e r t y u i o p å ¨
a s d f g h j k l æ ø '  
 < z x c v b n m , . - 
]],[[
§ ! " # ¤ % & / ( ) = ? ` 
 Q W E R T Y U I O P Å ^
A S D F G H J K L Æ Ø *  
 > Z X C V B N M ; : _ 
]],[[
  @ £ $ €  { [ ] }  | 
   €         ~
            
 \       µ    
]],
nil, 
},["ka"] = {
[[
„ ! ? № § % : . ; , / – = 
 ღ ჯ უ კ ე ნ გ შ წ ზ ხ ც (
ფ ძ ვ თ ა პ რ ო ლ დ ჟ 
 ( ჭ ჩ ყ ს მ ი ტ ქ ბ / 
]],[[
“ 1 2 3 4 5 6 7 8 9 0 - + 
 ღ ჯ უ კ ე ნ გ შ წ ზ ხ ც )
ფ ძ ვ თ ა პ რ ო ლ დ ჟ 
 ) ჭ ჩ ყ ს მ ი ტ ქ ბ / 
]],[[
             
     ჱ      ჴ  
ჶ  ჳ         
       ჲ     
]],
nil, 
},["ja"] = {
[[
ろ:Ro ぬ:Nu ふ:Hu あ:A う:U え:E お:O や:Ya ゆ:Yu よ:Yo わ:Wa ほ:Ho へ:He 
 た:Ta て:Te い:I す:Su か:Ka ん:N な:Na に:Ni ら:Ra せ:Se ゛ ゜ む:Mu
ち:Ti と:To し:Si は:Ha き:Ki く:Ku ま:Ma の:No り:Ri れ:Re け:Ke 
 つ:Tu さ:Sa そ:So ひ:Hi こ:Ko み:Mi も:Mo ね:Ne る:Ru め:Me 
]],[[
ろ:Ro ぬ:Nu ふ:Hu ぁ:a ぅ:u ぇ:e ぉ:o ゃ:ya ゅ:yu ょ:yo を:Wo ー へ:He 
 た:Ta て:Te ぃ:i す:Su か:Ka ん:N な:Na に:Ni ら:Ra せ:Se 「 」 む:Mu
ち:Ti と:To し:Si は:Ha き:Ki く:Ku ま:Ma の:No り:Ri れ:Re け:Ke 
 っ:tu さ:Sa そ:So ひ:Hi こ:Ko み:Mi も:Mo 、 。 ・ 
]],
nil, 
nil, 
},["en-5"] = {
[[
< 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] `
a s d f g h j k l ; ' 
 \ z x c v b n m , . / 
]],[[
> ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } ~
A S D F G H J K L : " 
 | Z X C V B N M , . ? 
]],
nil, 
nil, 
},["ha"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] \
a s d f g h j k l ; ' 
 \ z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } |
A S D F G H J K L : " 
 | Z X C V B N M < > / 
]],[[
     €    ‘ ’   
      ƴ       
  ɗ     ƙ  ¶ ’ 
      ɓ      
]],[[
             
      Ƴ       ¦
  Ɗ     Ƙ    
      Ɓ      
]],
},["si"] = {
[[
්ර 1 2 3 4 5 6 7 8 9 0 - = 
 ු අ ැ ර ඒ හ ම ස ද ච ඤ ; 
් ි ා ෙ ට ය ව න ක ත . 
  ' ං ජ ඩ ඉ බ ප ල ග / 
]],[[
ර් ! @ $ $ % ^ & * ( ) _ + 
 ූ උ ෑ ඍ ඔ ශ ඹ ෂ ධ ඡ ඥ : 
ෟ ී ෘ ෆ ඨ ්ය ළු ණ ඛ ථ , 
  " ඃ ඣ ඪ ඊ භ ඵ ළ ඝ / 
]],[[
             
             
ෳ          ෴ 
   ඞ ඦ ඬ    ඏ ඟ  
]],
nil, 
},["hi"] = {
[[
 1 2 3 4 5 6 7 8 9 0 - ृ 
 ौ ै ा ी ू ब ह ग द ज ड ़ ॉ
ो े ् ि ु प र क त च ट 
 ॉ ं म न व ल स , . / 
]],[[
 ऍ ॅ ्र र् ज्ञ त्र क्ष श्र ( ) ः ऋ 
 औ ऐ आ ई ऊ भ ङ घ ध झ ढ ञ ऑ
ओ ए अ इ उ फ ऱ ख थ छ ठ 
 ऑ ँ ण   ळ श ष । / 
]],[[
` १ २ ३ ४ ५ ६ ७ ८ ९ ० - = 
           [ ] \
         ; ' 
        , .  
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
           { } |
         : " 
  ॐ      < >  
]],
},["ru-2"] = {
[[
| № - / " : , . _ ? % ! ; 
 й ц у к е н г ш щ з х ъ )
ф ы в а п р о л д ж э 
 ) я ч с м и т ь б ю / 
]],[[
+ 1 2 3 4 5 6 7 8 9 0 = \ 
 Й Ц У К Е Н Г Ш Щ З Х Ъ (
Ф Ы В А П Р О Л Д Ж Э 
 ( Я Ч С М И Т Ь Б Ю / 
]],
nil, 
nil, 
},["fi"] = {
[[
§ 1 2 3 4 5 6 7 8 9 0 + ´ 
 q w e r t y u i o p å ¨ 
a s d f g h j k l ö ä ' 
 < z x c v b n m , . - 
]],[[
½ ! " # ¤ % & / ( ) = ? ` 
 Q W E R T Y U I O P Å ^ 
A S D F G H J K L Ö Ä * 
 > Z X C V B N M ; : _ 
]],[[
  @ £ $ €  { [ ] } \  
   €         ~ 
            
 |       µ    
]],
nil, 
},["mi"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] \
a s d f g h j k l ; ' 
 \ z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } |
A S D F G H J K L : " 
 | Z X C V B N M < > / 
]],
nil, 
nil, 
},["en-ca"] = {
[[
/ 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p ^ ç 
a s d f g h j k l ; è à 
 ù z x c v b n m , . é 
]],[[
\ ! @ # $ % ? & * ( ) _ + 
 Q W E R T Y U I O P ¨ Ç 
A S D F G H J K L : È À 
 Ù Z X C V B N M ' " É 
]],[[
|       { } [ ]  ¬ 
           ` ~ 
         °   
  « »      < >  
]],
nil, 
},["ta"] = {
[[
ொ 1 2 3 4 5 6 7 8 9 0 -  
 ௌ ை ா ீ ூ ப ஹ க த ஜ ட ஞ
ோ ே ் ி ு ப ர க த ச ட 
 ெ  ம ந வ ல ஸ , . / 
]],[[
ஒ      த்ர க்ஷ ஷ்ர   ஃ  
 ஔ ஐ ஆ ஈ ஊ ப ங க த ச ட ஞ
ஓ ஏ அ இ உ ப ற க த ச ட 
 எ  ண ன ழ ள ஷ ஷ ஸ்ரீ / 
]],[[
 ௧ ௨ ௩ ௪ ௫ ௬ ௭ ௮ ௯ ௰ ௱ ௲ 
            
           
           
]],
nil, 
},["bg-3"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - . 
 , у е и ш щ к с д з ц ; (
ь я а о ж г т н в м ч 
 \ ю й ъ э ф х п р л / 
]],[[
~ ! ? + " % = : / _ № І V 
 ы У Е И Ш Щ К С Д З Ц § )
Ь Я А О Ж Г Т Н В М Ч 
 | Ю Й Ъ Э Ф Х П Р Л / 
]],
nil, 
nil, 
},["syr"] = {
[[
܏ 1 2 3 4 5 6 7 8 9 0 - = 
 ܔ ܨ ܖ ܩ ܦ ܜ ܥ ܗ ܞ ܚ ܓ ܕ ܆
ܫ ܣ ܝ ܒ ܠ ܐ ܬ ܢ ܡ ܟ ܛ 
 ܆ ] [ ܤ ܪ ܧ ܀ . ܘ ܙ / 
]],[[
̮ ! ̊ ̥ ݉ ♰ ♱ ܊ » ) ( « + 
 ܰ ܳ ܶ ܺ ܽ ݀ ݁ ̈ ̄ ̇ ̃ ݊ :
ܱ ܴ ܷ ܻ ܾ ܑ ـ ̤ ̱ ̣ ̰ 
 : ܲ ܵ ܸ ܼ ܿ ܹ ݂ ، ؛ / 
]],[[
ّ ܁ ܂ ܃ ܄ ܅ ܈ ܉ ܋ ܌ ܍ ┌ ┐ 
 َ ً ُ ٌ ٓ ٔ ݇ ݃ ݅ ̭   
ِ ٍ  ء ٕ ٰ ݈ ݄ ݆   
   ْ         
]],
nil, 
},["tn-2"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] \
a s d f g h j k l ; ' 
 z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } |
A S D F G H J K L : " 
 Z X C V B N M < > / 
]],[[
 ¡ ² ³ ¤ € ¼ ½ ¾ ‘ ’ ¥ × 
 ä å é ® þ ü ú í ó ö « » ¬
á ß ð      ø ¶ ´ 
 æ  ©   ñ µ ç š  
]],[[
 ¹   £        ÷ 
 Ä Å É  Þ Ü Ú Í Ó Ö   ¦
Á § Ð      Ø ° ¨ 
 Æ  ¢   Ñ  Ç Š  
]],
},["mn-2"] = {
[[
᠍ 1 2 3 4 5 6 7 8 9 0   = 
 ᠴ ᠣ ᠡ ᠷ ᠲ ᠶ ᠦ ᠢ ᠥ ᠫ 〔 〕 ᠁
ᠠ ᠰ ᠳ ᠹ ᠭ ᠬ ᠵ ᠺ ᠯ ; ᠋ 
  ᠽ ᠱ ᠼ ᠤ ᠪ ᠨ ᠮ ᠂ ᠃ / 
]],[[
~ ! ⁈ ⁉ — %  ᠊  ( ) ᠎ + 
  ᠸ ᠧ ᠿ       〈 〉 |
     ᠾ  ᠻ ᡀ ᠄ ᠌ 
  ᡁ  ᡂ   ᠩ  《 》 / 
]],
nil, 
nil, 
},["th"] = {
[[
_ ๅ / - ภ ถ ุ ึ ค ต จ ข ช 
 ๆ ไ ำ พ ะ ั ี ร น ย บ ล ฃ
ฟ ห ก ด เ ้ ่ า ส ว ง 
 ผ ป แ อ ิ ื ท ม ใ ฝ 
]],[[
% + ๑ ๒ ๓ ๔ ู ฿ ๕ ๖ ๗ ๘ ๙ 
 ๐ " ฎ ฑ ธ ํ ๊ ณ ฯ ญ ฐ , ฅ
ฤ ฆ ฏ โ ฌ ็ ๋ ษ ศ ซ . 
 ( ) ฉ ฮ ฺ ์ ? ฒ ฬ ฦ 
]],
nil, 
nil, 
},["dv-2"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 ޫ ޮ ާ ީ ޭ ގ ރ މ ތ ހ ލ [ ]
ި ު ް ަ ެ ވ އ ނ ކ ފ ﷲ 
 \ ޒ ޑ ސ ޔ ޅ ދ ބ ށ ޓ / 
]],[[
~ ! @ # $ % ^ & * ) ( _ + 
 × ’ “ / : ޤ ޜ ޣ ޠ ޙ ÷ { }
< > . ، " ޥ ޢ ޘ ޚ ޡ ؛ 
 | ޖ ޕ ޏ ޗ ޟ ޛ ޝ \ ޞ / 
]],[[
             
             
   ,       ; 
            
]],
nil, 
},["de-2"] = {
[[
^ 1 2 3 4 5 6 7 8 9 0 ß ´ 
 q w e r t z u i o p ü +
a s d f g h j k l ö ä # 
 < y x c v b n m , . - 
]],[[
° ! " § $ % & / ( ) = ? ` 
 Q W E R T Z U I O P Ü *
A S D F G H J K L Ö Ä ' 
 > Y X C V B N M ; : _ 
]],[[
  ² ³    { [ ] } \  
 @  €         ~
            
 |       µ    
]],
nil, 
},["ro-3"] = {
[[
„ 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p ă î â
a s d f g h j k l ș ț 
 \ z x c v b n m , . / 
]],[[
” ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P Ă Î Â
A S D F G H J K L Ș Ț 
 | Z X C V B N M ; : / 
]],[[
` ~ ˇ ^ ˘ ° ˛ ` ˙ ´ ˝ ¨ ¸ 
   €       § [ ] \
 ß đ      ł ; ' 
    ©     < >  
]],[[
~           – ± 
           { } |
  Đ      Ł : " 
         « »  
]],
},["wen-3"] = {
[[
^ 1 2 3 4 5 6 7 8 9 0 ß ´ 
 q w e r t z u i o p ü + ł
a s d f g h j k l ö ä 
 < y x c v b n m , . / 
]],[[
° ! " § $ % & / ( ) = ? ` 
 Q W E R T Z U I O P Ü * Ł
A S D F G H J K L Ö Ä 
 > Y X C V B N M ; : / 
]],[[
 » « „ ‚ ‘ “ { [ ] } \  
 @  €         ~ #
           
 |       µ    
]],
nil, 
},["bn-2"] = {
[[
১ ২ ৩ ৪ ৫ ৬ ৭ ৮ ৯ ০ - ৃ 
 ৌ ৈ া ী ূ ব হ গ দ জ ড ়
ো ে ্ ি ু প র ক ত চ ট 
 ং ম ন ব ল স , . / 
]],[[
! @  র্ জ্ঞ ত্র ক্ষ শ্র ( ) ঃ ঋ 
 ঔ ঐ আ ঈ ঊ ভ ঙ ঘ ধ ঝ ঢ ঞ
ও এ অ ই উ ফ  খ থ ছ ঠ 
 ঁ ণ    শ ষ  / 
]],
nil, 
nil, 
},["hy-w"] = {
[[
՝ : ձ յ ՛ , - . « » օ ռ ժ 
 խ վ է ր դ ե ը ի ո բ չ ջ '
ա ս տ ֆ կ հ ճ ք լ թ փ 
 ' զ ց գ ւ պ ն մ շ ղ / 
]],[[
՜ 1 Ձ Յ 3 4 9 և ( ) Օ Ռ Ժ 
 Խ Վ Է Ր Դ Ե Ը Ի Ո Բ Չ Ջ ՞
Ա Ս Տ Ֆ Կ Հ Ճ Ք Լ Թ Փ 
 ՞ Զ Ց Գ Ւ Պ Ն Մ Շ Ղ / 
]],
nil, 
nil, 
},["bo"] = {
[[
ཨ ༡ ༢ ༣ ༤ ༥ ༦ ༧ ༨ ༩ ༠ ཧ ཝ 
 ཅ ཆ ེ ར ཏ ཡ ུ ི ོ ཕ ཙ ཚ ཛ
འ ས ད བ ང མ ་ ག ལ ཞ ། 
 ཟ ཤ ཀ ཁ པ ན m ཐ ཇ / 
]],[[
༁ ༪ ༫ ༬ ༭ ༮ ༯ ༰ ༱ ༲ ༳ ༼ ༽ 
 ༕ ༖ ༗ ྼ ཊ ྻ ༘ ༙ ༚ ༛ ༜ ༝ ༞
ཱ ༟ ཌ ༾ ༿ ࿏ ༂ ༃ ༆ ༇ ༸ 
 ༴ ཥ ཀྵ ྇ ྆ ཎ M ཋ ༺ / 
]],[[
             
             
           
           
]],[[
ༀ ྲྀ ཷ ླྀ ཹ ཱི ༉ ༊ ༏ ༐ ༒ ༌ ༓ 
 ྉ ྈ ྾ ཪ ྚ ྿ ཱུ ཱི ࿀ ࿁ ࿂ ࿃ ཛྷ
࿄ ࿅ ྜ བྷ ࿆ ࿇ ࿈ གྷ ࿉ ࿊ ࿋ 
 ࿌ ྵ ྐྵ ༶ ྂ ྞ དྷ ྛ ྋ  
]],
},["mk-2"] = {
[[
ѝ 1 2 3 4 5 6 7 8 9 0 - = 
 љ њ е р т ѕ у и о п ш ѓ ж
а с д ф г х ј к л ч ќ 
 ѐ з џ ц в б н м , . / 
]],[[
Ѝ ! „ “ ' % ‚ ‘ * ( ) - + 
 Љ Њ Е Р Т Ѕ У И О П Ш Ѓ Ж
А С Д Ф Г Х Ј К Л Ч Ќ 
 Ѐ З Џ Ц В Б Н М ; : / 
]],[[
 ° @ # $  ^ & … { } — ́ 
           [ ] |
           
         < >  
]],
nil, 
},["sk-2"] = {
[[
; + ľ š č ť ž ý á í é = ´ 
 q w e r t y u i o p ú ä ň
a s d f g h j k l ô § 
 & z x c v b n m , . / 
]],[[
° 1 2 3 4 5 6 7 8 9 0 % ˇ 
 Q W E R T Y U I O P / ( )
A S D F G H J K L " ! 
 * Z X C V B N M ? : / 
]],[[
 ~ ˇ ^ ˘ ° ˛ ` ˙ ´ ˝ ¨ ¸ 
 \ | €       ' ÷ × ¤
 đ Đ [ ]   ł Ł $ ß 
 < > # & @ { }  < >  
]],
nil, 
},["nl-fr-de"] = {
[[
² & é " ' ( § è ! ç à ) - 
 a z e r t y u i o p ^ $ µ
q s d f g h j k l m ù 
 < w x c v b n , ; : / 
]],[[
³ 1 2 3 4 5 6 7 8 9 0 ° _ 
 A Z E R T Y U I O P ¨ * £
Q S D F G H J K L M % 
 > W X C V B N ? . / / 
]],[[
 | @ # { [ ^   { }   
   €        [ ] 
          ´ 
 \           
]],
nil, 
},["bg"] = {
[[
ч 1 2 3 4 5 6 7 8 9 0 - = 
 я в е р т ъ у и о п ш щ ю
а с д ф г х й к л ; ' 
 ю з ь ц ж б н м , . / 
]],[[
Ч ! @ № $ % € § * ( ) _ + 
 Я В Е Р Т Ъ У И О П Ш Щ Ю
А С Д Ф Г Х Й К Л : " 
 Ю З ѝ Ц Ж Б Н М < > / 
]],
nil, 
nil, 
},["ro"] = {
[[
] 1 2 3 4 5 6 7 8 9 0 + ' 
 q w e r t z u i o p ă î â
a s d f g h j k l ş ţ 
 < y x c v b n m , . / 
]],[[
[ ! " # ¤ % & / ( ) = ? * 
 Q W E R T Z U I O P Ă Î Â
A S D F G H J K L Ş Ţ 
 > Y X C V B N M ; : / 
]],[[
 ~ ˇ ^ ˘ ° ˛ ` · ´ ˝ ¨ ¸ 
 \ |         ÷ × 
 đ Đ     ł Ł $ ß 
     @ { } § < >  
]],
nil, 
},["sv"] = {
[[
§ 1 2 3 4 5 6 7 8 9 0 + ´ 
 q w e r t y u i o p å ¨
a s d f g h j k l ö ä ' 
 < z x c v b n m , . - 
]],[[
½ ! " # ¤ % & / ( ) = ? ` 
 Q W E R T Y U I O P Å ^
A S D F G H J K L Ö Ä * 
 > Z X C V B N M ; : _ 
]],[[
  @ £ $ €  { [ ] } \  
   €         ~
            
 |       µ    
]],
nil, 
},["th-3"] = {
[[
_ = ๒ ๓ ๔ ๕ ู ๗ ๘ ๙ ๐ ๑ ๖ 
 ็ ต ย อ ร ่ ด ม ว แ ใ ฌ 
้ ท ง ก ั ี า น เ ไ ข 
 บ ป ล ห ิ ค ส ะ จ พ 
]],[[
฿ + " / , ? ุ _ . ( ) - % 
 ๊ ฤ ๆ ญ ษ ึ ฝ ซ ถ ฒ ฯ ฦ ํ
๋ ธ ำ ณ ์ ื ผ ช โ ฆ ฑ 
 ฎ ฏ ฐ ภ ั ศ ฮ ฟ ฉ ฬ 
]],
nil, 
nil, 
},["ig"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] \
a s d f g h j k l ; ' 
 \ z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } |
A S D F G H J K L : " 
 | Z X C V B N M < > / 
]],[[
     €    ‘ ’   
 ị́ ị̀ ị̄    ụ ị ọ    
ọ́ ọ̀ ọ̄ ụ́ ụ̀ ụ̄    ¶ ´ 
       ṅ m̀ m̄ n̄  
]],[[
             
 Ị́ Ị̀ Ị̄    Ụ Ị Ọ    ¦
Ọ́ Ọ̀ Ọ̄ Ụ́ Ụ̀ Ụ̄      
       Ṅ M̀ M̄ N̄  
]],
},["es-2"] = {
[[
º 1 2 3 4 5 6 7 8 9 0 ' ¡ 
 q w e r t y u i o p ` +
a s d f g h j k l ñ ´ ç 
 < z x c v b n m , . - 
]],[[
ª ! " · $ % & / ( ) = ? ¿ 
 Q W E R T Y U I O P ^ *
A S D F G H J K L Ñ ¨ Ç 
 > Z X C V B N M ; : _ 
]],[[
\ | @ # ~ € ¬       
   €        [ ]
          { } 
            
]],
nil, 
},["lo"] = {
[[
" ຢ ຟ ໂ ຖ ຸ ູ ຄ ຕ ຈ ຂ ຊ ໍ 
 ົ ໄ ຳ ພ ະ ິ ີ ຮ ນ ຍ ບ ລ /
ັ ຫ ກ ດ ເ ້ ່ າ ສ ວ ງ 
 ຜ ປ ແ ອ ຶ ື ທ ມ ໃ / 
]],[[
' 1 2 3 4 ໌ ຼ 5 6 7 8 9 ໍ່ 
 ົ້ 0 * _ + ິ້ ີ້ ຣ ໜ ຽ - ຫຼ \
ັ້ ; . , : ໊ ໋ ! ? % = 
 ₭ ( ຯ x ຶ້ ື້ ໆ ໝ $ / 
]],[[
 ໑ ໒ ໓ ໔ ໕ ໖ ໗ ໘ ໙ ໐   
             
           
           
]],
nil, 
},["ko"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 ᄇ ᄌ ᄃ ᄀ ᄉ ᅭ ᅧ ᅣ ᅢ ᅦ [ ] ₩
ᄆ ᄂ ᄋ ᄅ ᄒ ᅩ ᅥ ᅡ ᅵ ; ' 
 ᄏ ᄐ ᄎ ᄑ ᅲ ᅮ ᅳ , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 ᄈ ᄍ ᄄ ᄁ ᄊ ᅭ ᅧ ᅣ ᅤ ᅨ { } |
ᄆ ᄂ ᄋ ᄅ ᄒ ᅩ ᅥ ᅡ ᅵ : " 
 ᄏ ᄐ ᄎ ᄑ ᅲ ᅮ ᅳ < > ? 
]],[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] ₩
a s d f g h j k l ; ' 
 z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } |
A S D F G H J K L : " 
 Z X C V B N M < > ? 
]],
},["fo"] = {
[[
½ 1 2 3 4 5 6 7 8 9 0 + ´ 
 q w e r t y u i o p å ð 
a s d f g h j k l æ ø ' 
 < z x c v b n m , . - 
]],[[
§ ! " # ¤ % & / ( ) = ? ` 
 Q W E R T Y U I O P Å Ð 
A S D F G H J K L Æ Ø * 
 > Z X C V B N M ; : _ 
]],[[
  @ £ $ €  { [ ] }  | 
   €        ¨ ~ 
          ^  
 \       µ    
]],
nil, 
},["sv-se"] = {
[[
§ 1 2 3 4 5 6 7 8 9 0 + ´ 
 q w e r t y u i o p å ¨ '
a s d f g h j k l ö ä 
 < z x c v b n m , . / 
]],[[
½ ! " # ¤ % & / ( ) = ? ` 
 Q W E R T Y U I O P Å ^ *
A S D F G H J K L Ö Ä 
 > Z X C V B N M ; : / 
]],[[
  @ £ $ €  { [ ] } \  
 â  €  ŧ   ï õ   ~ 
á š đ ǥ ǧ ȟ  ǩ  ø æ 
 | ž  č ǯ ʒ ŋ µ    
]],[[
             
 Â    Ŧ   Ï Õ    
Á Š Đ Ǥ Ǧ Ȟ  Ǩ  Ø Æ 
  Ž  Č Ǯ Ʒ Ŋ     
]],
},["bn"] = {
[[
1 2 3 4 5 6 7 8 9 0 - ৃ 
 ৌ ৈ া ী ূ ব হ গ দ জ ড ়
ো ে ্ ি ু প র ক ত চ ট 
 ং ম ন ব ল স , . / 
]],[[
  ্র র্ জ্র ত্ষ ক্র শ্র ( ) ঃ ঋ 
 ঔ ঐ আ ঈ ঊ ভ ঙ ঘ ধ ঝ ঢ ঞ
ও এ অ ই উ ফ  খ থ ছ ঠ 
 ঁ ণ    শ ষ { / 
]],[[
১ ২ ৩ ৪ ৫ ৬ ৭ ৮ ৯ ০  ৢ 
 ৗ   ৣ       ড় 
৴ ৶ ৸ ৢ   ৰ     
 ৺         
]],[[
           ৠ 
    ৡ       ঢ় 
৵ ৷ ৹ ঌ   ৱ     
          
]],
},["dv"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 ް އ ެ ރ ތ ޔ ު ި ޮ ޕ ] [ \
ަ ސ ދ ފ ގ ހ ޖ ކ ލ ؛ ' 
 \ ޒ × ޗ ވ ބ ނ މ ، . / 
]],[[
~ ! @ # $ % ^ & * ) ( _ + 
 ޤ ޢ ޭ ޜ ޓ ޠ ޫ ީ ޯ ÷ } { |
ާ ށ ޑ ﷲ ޣ ޙ ޛ ޚ ޅ : " 
 | ޡ ޘ ޝ ޥ ޞ ޏ ޟ > < / 
]],[[
             
             
         ;  
         ,   
]],
nil, 
},["pl-2"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ]
a s d f g h j k l ; ' \ 
 z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { }
A S D F G H J K L : " | 
 Z X C V B N M < > ? 
]],[[
             
   ę    €  ó   
ą ś       ł    
 ż ź ć   ń     
]],[[
             
   Ę      Ó   
Ą Ś       Ł    
 Ż Ź Ć   Ń     
]],
},["vi"] = {
[[
` ă â ê ô ̀ ̉ ̃ ́ ̣ đ - ₫ 
 q w e r t y u i o p ư ơ \
a s d f g h j k l ; ' 
 \ z x c v b n m , . / 
]],[[
~ Ă Â Ê Ô ̀ ̉ ̃ ́ ̣ Đ _ + 
 Q W E R T Y U I O P Ư Ơ |
A S D F G H J K L : " 
 | Z X C V B N M < > / 
]],[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] \
a s d f g h j k l ; ' 
 \ z x c v b n m , .  
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } |
A S D F G H J K L : " 
 | Z X C V B N M < >  
]],
},["lv"] = {
[[
­ 1 2 3 4 5 6 7 8 9 0 - f 
 ū g j r m v n z ē č ž h ķ
š u s i l d a t e c ´ 
 ģ ņ b ī k p o ā , . / 
]],[[
? ! « » $ % / & × ( ) _ F 
 Ū G J R M V N Z Ē Č Ž H Ķ
Š U S I L D A T E C ° 
 Ģ Ņ B Ī K P O Ā ; : / 
]],[[
 «   € " ’  :   – = 
 q ģ  ŗ w y     [ ] 
        €  ´ 
 \  x  ķ  õ  < >  
]],[[
  @ # $ ~ ^ ±    — ; 
 Q Ģ  " ' Y     { } 
          ¨ 
 |  X  Ķ  Õ     
]],
},["lt-2"] = {
[[
` ! " / ; : , . ? ( ) _ + 
 ą ž e r t y u i o p į “ |
a s d f g h j k l ų ė 
 \ z ū c v b n m č š / 
]],[[
~ 1 2 3 4 5 6 7 8 9 0 - = 
 Ą Ž E R T Y U I O P Į ” \
A S D F G H J K L Ų Ė 
 | Z Ū C V B N M Č Š / 
]],[[
       { [ ] }   
   €          
           
            
]],
nil, 
},["mt-2"] = {
[[
ċ 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p ġ ħ #
a s d f g h j k l ; ' 
 ż z x c v b n m , . / 
]],[[
Ċ ! " € $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P Ġ Ħ ~
A S D F G H J K L : @ 
 Ż Z X C V B N M < > / 
]],[[
`   £          
   è    ù ì ò  [ ] 
à           
 \           
]],[[
¬             
   È    Ù Ì Ò  { } 
À           
 |           
]],
},["tn"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] \
a s d f g h j k l ; ' 
 \ z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } |
A S D F G H J K L : " 
 | Z X C V B N M < > / 
]],[[
 ¡ ² ³ ¤ € ¼ ½ ¾ ‘ ’ ¥ × 
 ä å é ® þ ü ú í ó ö « » ¬
á ß ð      ø ¶ ´ 
  æ  ©   ñ µ ç š  
]],[[
 ¹   £        ÷ 
 Ä Å É  Þ Ü Ú Í Ó Ö   ¦
Á § Ð      Ø ° ¨ 
  Æ  ¢   Ñ  Ç Š  
]],
},["pt-2"] = {
[[
' 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p ´ [
a s d f g h j k l ç ~ ] 
 \ z x c v b n m , . ; / 
]],[[
" ! @ # $ % ¨ & * ( ) _ + 
 Q W E R T Y U I O P ` {
A S D F G H J K L Ç ^ } 
 | Z X C V B N M < > : ? 
]],[[
 ¹ ² ³ £ ¢ ¬      § 
 / ? °         ª
           º 
    ₢        ° 
]],
nil, 
},["yo"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] 
a s d f g h j k l ; ' 
 \ z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } |
A S D F G H J K L : " 
 | Z X C V B N M < > / 
]],[[
     €    ‘ ’   
             
ọ́ ọ̀      ẹ́ ẹ̀ ¶  
            
]],[[
             
             ¦
Ọ́ Ọ̀      Ẹ́ Ẹ̀  ¨ 
            
]],
},["pa"] = {
[[
 1 2 3 4 5 6 7 8 9 0 -  
 ੌ ੈ ਾ ੀ ੂ ਬ ਹ ਗ ਦ ਜ ਡ ਼
ੋ ੇ ੍ ਿ ੁ ਪ ਰ ਕ ਤ ਚ ਟ 
 ੰ ਮ ਨ ਵ ਲ ਸ , . / 
]],[[
੍ਹ ੍ਵ ੍ਯ ੍ਰ ੱ     ( )   
 ਔ ਐ ਆ ਈ ਊ ਭ ਙ ਘ ਧ ਝ ਢ ਞ
ਓ ਏ ਅ ਇ ਉ ਫ ੜ ਖ ਥ ਛ ਠ 
 ਂ ਣ  ੲ ਲ਼ ਸ਼  । / 
]],[[
 ੧ ੨ ੩ ੪ ੫ ੬ ੭ ੮ ੯ ੦   
        ਗ਼  ਜ਼ ੜ 
     ਫ਼  ਖ਼    
    ੳ    ॥  
]],[[
             
            
           
 ੴ         
]],
},["wo"] = {
[[
ã & é " ' ( - ñ _ ŋ à ) = 
 a z e r t y u i o p ^ ó *
q s d f g h j k l m ù 
 < w x c v b n , ; : / 
]],[[
Ã 1 2 3 4 5 6 7 8 9 0 É + 
 A Z E R T Y U I O P ¨ Ó Ñ
Q S D F G H J K L M À 
 > W X C V B N ? . / / 
]],[[
  ~ # { [ | ` \ ^ @ ] } 
   €         ¤ 
           
            
]],
nil, 
},["kn"] = {
[[
ೊ 1 2 3 4 5 6 7 8 9 0 - ೃ 
 ೌ ೈ ಾ ೀ ೂ ಬ ಹ ಗ ದ ಜ ಡ 
ೋ ೇ ್ ಿ ು ಪ ರ ಕ ತ ಚ ಟ 
 ೆ ಂ ಮ ನ ವ ಲ ಸ , . / 
]],[[
ಒ   ್ರ ರ್ ಜ್ಞ ತ್ರ ಕ್ಷ ಶ್ರ ( ) ಃ ಋ 
 ಔ ಐ ಆ ಈ ಊ ಭ ಙ ಘ ಧ ಝ ಢ ಞ
ಓ ಏ ಅ ಇ ಉ ಫ ಱ ಖ ಥ ಛ ಠ 
 ಎ  ಣ   ಳ ಶ ಷ | / 
]],[[
 ೧ ೨ ೩ ೪ ೫ ೬ ೭ ೮ ೯ ೦  ೄ 
  ೖ          
 ೕ          
           
]],[[
            ೠ 
    ೡ        
   ಌ  ೞ      
           
]],
},["ug"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 چ ۋ ې ر ت ي ۇ ڭ و پ ] [ \
ھ س د ا ە ى ق ك ل ؛ ' 
 ز ش غ ۈ ب ن م ، . / 
]],[[
~ ! @ # $ % ^ & * ) ( _ + 
           » « |
  ژ ف گ خ ج ۆ لا : " 
        > < / 
]],
nil, 
nil, 
},["en"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 [ ] 
 ' , . p y f g c r l / = \
a o e u i d h t n s - 
 ; q j k x b m w v z 
]],[[
~ ! @ # $ % ^ & * ( ) { } 
 " < > P Y F G C R L ? + |
A O E U I D H T N S _ 
 : Q J K X B M W V Z 
]],
nil, 
nil, 
},["it-2"] = {
[[
\ 1 2 3 4 5 6 7 8 9 0 ' ì 
 q w e r t y u i o p è +
a s d f g h j k l ò à ù 
 < z x c v b n m , . - 
]],[[
| ! " £ $ % & / ( ) = ? ^ 
 Q W E R T Y U I O P é *
A S D F G H J K L ç ° § 
 > Z X C V B N M ; : _ 
]],[[
   #  €  { [ ] }   
 @  €         ~
           ` 
            
]],
nil, 
},["tr-2"] = {
[[
" 1 2 3 4 5 6 7 8 9 0 * - 
 q w e r t y u ı o p ğ ü
a s d f g h j k l ş i , 
 < z x c v b n m ö ç . 
]],[[
é ! ' ^ + % & / ( ) = ? _ 
 Q W E R T Y U I O P Ğ Ü
A S D F G H J K L Ş İ ; 
 > Z X C V B N M Ö Ç : 
]],[[
< > £ # $ ½  { [ ] } \ | 
 @  €     i   ¨ ~
æ ß        ´  ` 
 |           
]],[[
             
        İ    
Æ            
            
]],
},["en-4"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] \
a s d f g h j k l ; ' 
 \ z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } |
A S D F G H J K L : " 
 | Z X C V B N M < > / 
]],
nil, 
nil, 
},["en-3"] = {
[[
` 1 2 3 4 j l m f p / [ ] 
 5 6 q . o r s u y b ; = \
7 8 z a e h t d c k - 
 9 0 x , i n w v g ' 
]],[[
~ ! @ # $ J L M F P ? { } 
 % ^ Q > O R S U Y B : + |
& * Z A E H T D C K _ 
 ( ) X < I N W V G " 
]],
nil, 
nil, 
},["iu"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] \
a s d f g h j k l ; ' 
 \ z x c v b n m , . / 
]],[[
~ 1 2 3 4 5 6 7 8 9 0 _ + 
 Q W E R T Y U I O P { } |
A S D F G H J K L : " 
 | Z X C V B N M < > / 
]],[[
 ! @ # $ % * & • [ ]  = 
 ᖐ ᐄ ᖀ ᑮ ᑏ ᓰ ᒦ ᓃ ᓖ ᔩ “ ‘ 
ᖒ ᐆ ᖂ ᑰ ᑑ ᓲ ᒨ ᓅ ᓘ … ł 
  ᖔ ᐋ ᖄ ᑳ ᑖ ᓵ ᒫ    
]],[[
~ ¢ ® ¼ ½ ¾ ^ ⅔ © ÷ +   
 ᒌ ᐲ ᕇ  ᙲ ᙴ ᙶ ᖥ ᖡ  ” ’ |
ᒎ ᐴ ᕉ ᕖ   ᔫ ᕘ ᖣ  Ł 
 | ᒑ ᐹ ᕌ { } ᓈ ᓛ    
]],
},["hu"] = {
[[
0 1 2 3 4 5 6 7 8 9 ö ü ó 
 q w e r t z u i o p ő ú
a s d f g h j k l é á ű 
 í y x c v b n m , . - 
]],[[
§ ' " + ! % / = ( ) Ö Ü Ó 
 Q W E R T Z U I O P Ő Ú
A S D F G H J K L É Á Ű 
 Í Y X C V B N M ? : _ 
]],[[
 ~ ˇ ^ ˘ ° ˛ ` ˙ ´ ˝ ¨ ¸ 
 \ | Ä    € Í   ÷ ×
ä đ Đ [ ]  í ł Ł $ ß ¤ 
 < > # & @ { } < ; > * 
]],
nil, 
},["gu"] = {
[[
 1 2 3 4 5 6 7 8 9 0 - ૃ 
 ૌ ૈ ા ી ૂ બ હ ગ દ જ ડ ઼ ૉ
ો ે ્ િ ુ પ ર ક ત ચ ટ 
 ં મ ન વ લ સ , . / 
]],[[
 ઍ ૅ ્ર ર્ જ્ઞ ત્ર ક્ષ શ્ર ( ) ઃ ઋ 
 ઔ ઐ આ ઈ ઊ ભ ઙ ઘ ધ ઝ ઢ ઞ ઑ
ઓ એ અ ઇ ઉ ફ  ખ થ છ ઠ 
 ઁ ણ   ળ શ ષ । / 
]],[[
 ૧ ૨ ૩ ૪ ૫ ૬ ૭ ૮ ૯ ૦  ૄ 
             
           
        ॥  
]],[[
            ૠ 
             
           
 ૐ       ઽ  
]],
},["en-2"] = {
[[
` [ ] / p f m l j 4 3 2 1 
 ; q b y u r s o . 6 5 = \
- k c d t h e a z 8 7 
 ' x g v w n i , 0 9 
]],[[
~ { } ? P F M L J $ # @ ! 
 : Q B Y U R S O > ^ % + |
_ K C D T H E A Z * & 
 " X G V W N I < ) ( 
]],
nil, 
nil, 
},["en-uk-2"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] #
a s d f g h j k l ; ' 
 \ z x c v b n m , . / 
]],[[
¬ ! " £ $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } ~
A S D F G H J K L : @ 
 | Z X C V B N M < > / 
]],[[
¦  ¨  €  ^       
  ẃ é   ý ú í ó    ~
á          ´ 
    ç        
]],[[
             
  Ẃ É   Ý Ú Í Ó    
Á          ` 
    Ç        
]],
},["en-uk"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] #
a s d f g h j k l ; ' 
 \ z x c v b n m , . / 
]],[[
¬ ! " £ $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } ~
A S D F G H J K L : @ 
 | Z X C V B N M < > / 
]],[[
¦    €         
   é    ú í ó    
á           
            
]],[[
             
   É    Ú Í Ó    
Á           
            
]],
},["uk-2"] = {
[[
' 1 2 3 4 5 6 7 8 9 0 - = 
 й ц у к е н г ш щ з х ї \
ф і в а п р о л д ж є 
 ґ я ч с м и т ь б ю / 
]],[[
₴ ! " № ; % : ? * ( ) _ + 
 Й Ц У К Е Н Г Ш Щ З Х Ї /
Ф І В А П Р О Л Д Ж Є 
 Ґ Я Ч С М И Т Ь Б Ю / 
]],[[
             
       ґ      
           
            
]],[[
             
       Ґ      
           
            
]],
},["ru"] = {
[[
ё 1 2 3 4 5 6 7 8 9 0 - = 
 й ц у к е н г ш щ з х ъ \
ф ы в а п р о л д ж э 
 \ я ч с м и т ь б ю / 
]],[[
Ё ! " № ; % : ? * ( ) _ + 
 Й Ц У К Е Н Г Ш Щ З Х Ъ /
Ф Ы В А П Р О Л Д Ж Э 
 / Я Ч С М И Т Ь Б Ю / 
]],
nil, 
nil, 
},["en-6"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ]
a s d f g h j k l ; ' \ 
 z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { }
A S D F G H J K L : " | 
 Z X C V B N M < > ? 
]],[[
 ¡ ² ³ ¤ € ¼ ½ ¾ ‘ ’ ¥ × 
 ä å é ® þ ü ú í ó ö « »
á ß ð      ø ¶ ´ ¬ 
 æ  ©   ñ µ ç  ¿ 
]],[[
 ¹   £        ÷ 
 Ä Å É  Þ Ü Ú Í Ó Ö  
Á § Ð      Ø ° ¨ ¦ 
 Æ  ¢   Ñ  Ç   
]],
},["de"] = {
[[
^ 1 2 3 4 5 6 7 8 9 0 ß ´ 
 q w e r t z u i o p ü +
a s d f g h j k l ö ä # 
 < y x c v b n m , . - 
]],[[
° ! " § $ % & / ( ) = ? ` 
 Q W E R T Z U I O P Ü *
A S D F G H J K L Ö Ä ' 
 > Y X C V B N M ; : _ 
]],[[
  ² ³    { [ ] } \  
 @  €         ~
            
 |       µ    
]],
nil, 
},["iu-2"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] \
a s d f g h j k l ; ' 
 \ z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { [ |
A S D F G H J K L : " 
 | Z X C V B N M < > / 
]],[[
 ! @ # $ % * & • [ ]  = 
 ᖐ ᐄ ᖀ ᑮ ᑏ ᓰ ᒦ ᓃ ᓖ ᔩ “ ‘ 
ᖒ ᐆ ᖂ ᑰ ᑑ ᓲ ᒨ ᓅ ᓘ ŋ ł 
  ᖔ ᐋ ᖄ ᑳ ᑖ ᓵ ᒫ    
]],[[
~ ¢ ® ¼ ½ ¾ ^ ⅔ © ÷ +   
 ᒌ ᐲ ᕇ  ᙲ ᙴ ᙶ ᖥ ᖡ  ” ’ |
ᒎ ᐴ ᕉ ᕖ   ᔫ ᕘ ᖣ  Ł 
 | ᒑ ᐹ ᕌ { } ᓈ ᓛ    
]],
},["be"] = {
[[
ё 1 2 3 4 5 6 7 8 9 0 - = 
 й ц у к е н г ш ў з х ' \
ф ы в а п р о л д ж э 
 \ я ч с м і т ь б ю / 
]],[[
Ё ! " № ; % : ? * ( ) _ + 
 Й Ц У К Е Н Г Ш Ў З Х " /
Ф Ы В А П Р О Л Д Ж Э 
 / Я Ч С М І Т Ь Б Ю / 
]],
nil, 
nil, 
},["ka-3"] = {
[[
„ 1 2 3 4 5 6 7 8 9 0 - = 
 ქ წ ე რ ტ ყ უ ი ო პ [ ] ~
ა ს დ ფ გ ჰ ჯ კ ლ ; ' 
 \ ზ ხ ც ვ ბ ნ მ , . / 
]],[[
“ ! @ # $ % ^ & * ( ) _ + 
  ჭ  ღ თ      { } |
 შ     ჟ   : " 
  ძ  ჩ   N  < > / 
]],[[
  „ “  €   °   — – 
   ჱ ®  ჸ  ჲ     
ჺ   ჶ ჹ ჵ ჷ     
   ჴ © ჳ  ჼ  « »  
]],
nil, 
},["th-2"] = {
[[
_ ๅ / - ภ ถ ุ ึ ค ต จ ข ช 
 ๆ ไ ำ พ ะ ั ี ร น ย บ ล ฃ
ฟ ห ก ด เ ้ ่ า ส ว ง 
 ผ ป แ อ ิ ื ท ม ใ ฝ 
]],[[
% + ๑ ๒ ๓ ๔ ู ฿ ๕ ๖ ๗ ๘ ๙ 
 ๐ " ฎ ฑ ธ ํ ๊ ณ ฯ ญ ฐ , ฅ
ฤ ฆ ฏ โ ฌ ็ ๋ ษ ศ ซ . 
 ( ) ฉ ฮ ฺ ์ ? ฒ ฬ ฦ 
]],
nil, 
nil, 
},["ar-3"] = {
[[
> & é " ' ( - è _ ç à ) = 
 ض ص ث ق ف غ ع ه خ ح ج د 
ش س ي ب ل ا ت ن م ك ط ذ 
 \ ئ ء ؤ ر لا ى ة و ز ظ 
]],[[
< 1 2 3 4 5 6 7 8 9 0 ° + 
 َ ً ُ ٌ لإ إ ‘ ÷ × ؛ } { 
\  ] [ لأ أ ـ ، / : " ّ 
 | ~ ْ ِ ٍ لآ آ ’ , . ؟ 
]],[[
    ¤         
 َّ ًّ ُّ ٌّ         
            
    ِّ ٍّ       
]],
nil, 
},["ne"] = {
[[
ञ ज्ञ घ ङ झ छ ट ठ ड ढ ण ( . 
 त्र ध भ च त थ ग ष य उ ृ े ्र
ब क म ा न ज व प ि स ु 
 श ह अ ख द ल फ , । / 
]],[[
ञ् १ २ ३ ४ ५ ६ ७ ८ ९ ० ) ं 
 ो ध् भ् च् त् थ् ग् क्ष इ ए र् ै ्
ब् क् म् ँ न् ज् व् प् ी स् ू 
 श् ह् ऋ ख् द् ल् ः ? श्र / 
]],[[
 1 2 3 4 5 6 7 8 9 0  + 
          ऊ  औ 
           
   आ        
]],
nil, 
},["es"] = {
[[
| 1 2 3 4 5 6 7 8 9 0 ' ¿ 
 q w e r t y u i o p ´ +
a s d f g h j k l ñ { } 
 < z x c v b n m , . - 
]],[[
° ! " # $ % & / ( ) = ? ¡ 
 Q W E R T Y U I O P ¨ *
A S D F G H J K L Ñ [ ] 
 > Z X C V B N M ; : _ 
]],[[
¬           \  
 @           ~
          ^ ` 
            
]],
nil, 
},["wen"] = {
[[
^ 1 2 3 4 5 6 7 8 9 0 ß ´ 
 q w e r t z u i o p ü + #
a s d f g h j k l ö ä 
 < y x c v b n m , . / 
]],[[
° ! " § $ % & / ( ) = ? ` 
 Q W E R T Z U I O P Ü * '
A S D F G H J K L Ö Ä 
 > Y X C V B N M ; : / 
]],[[
  ² ³    { [ ] } \  
 @  €         ~ 
           
 |       µ    
]],
nil, 
},["bs"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 ' + 
 љ њ е р т з у и о п ш ђ ж
а с д ф г х ј к л ч ћ 
 < ѕ џ ц в б н м , . / 
]],[[
~ ! " # $ % & / ( ) = ? * 
 Љ Њ Е Р Т З У И О П Ш Ђ Ж
А С Д Ф Г Х Ј К Л Ч Ћ 
 > Ѕ Џ Ц В Б Н М ; : / 
]],[[
   ^  °        
 \ | €          
   [ ]       
     @ { } § < >  
]],
nil, 
},["tg"] = {
[[
ё 1 2 3 4 5 6 7 8 9 0 ғ ӯ 
 й қ у к е н г ш ҳ з х ъ \
ф ҷ в а п р о л д ж э 
 \ я ч с м и т ӣ б ю / 
]],[[
Ё ! " № ; % : ? * ( ) Ғ Ӯ 
 Й Қ У К Е Н Г Ш Ҳ З Х Ъ /
Ф Ҷ В А П Р О Л Д Ж Э 
 / Я Ч С М И Т Ӣ Б Ю / 
]],
nil, 
nil, 
},["mn"] = {
[[
= № - " ₮ : . _ , % ? е щ 
 ф ц у ж э н г ш ү з к ъ \
й ы б ө а х р о л д п 
 \ я ч ё с м и т ь в / 
]],[[
+ 1 2 3 4 5 6 7 8 9 0 Е Щ 
 Ф Ц У Ж Э Н Г Ш Ү З К Ъ |
Й Ы Б Ө А Х Р О Л Д П 
 | Я Ч Ё С М И Т Ь В / 
]],
nil, 
nil, 
},["he"] = {
[[
; 1 2 3 4 5 6 7 8 9 0 - = 
 / ' ק ר א ט ו ן ם פ ] [ \
ש ד ג כ ע י ח ל ך ף , 
 \ ז ס ב ה נ מ צ ת ץ / 
]],[[
~ ! @ # $ % ^ & * ) ( _ + 
 Q W E R T Y U I O P } { |
A S D F G H J K L : " 
 | Z X C V B N M > < / 
]],[[
    ₪       ֿ  
   €    װ      
     ײ ױ     
            
]],
nil, 
},["tt"] = {
[[
һ 1 2 3 4 5 6 7 8 9 0 - = 
 й ө у к е н г ш ә з х ү
ф ы в а п р о л д ң э \ 
 ґ я ч с м и т җ б ю . 
]],[[
Һ ! " № ; % : ? * ( ) _ + 
 Й Ө У К Е Н Г Ш Ә З Х Ү
Ф Ы В А П Р О Л Д Ң Э / 
 Ґ Я Ч С М И Т Җ Б Ю , 
]],[[
ё  @ # $   [ ] { }   
  ц       щ   ъ
         ж '  
        ь < >  
]],[[
Ё             
  Ц       Щ   Ъ
         Ж   
        Ь    
]],
},["el-6"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ]
a s d f g h j k l ; ' \ 
 z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { }
A S D F G H J K L : " | 
 Z X C V B N M < > ? 
]],[[
 ¡ ² ³ ¤ € ¼ ½ ¾ ‘ ’ ¥ × 
 ä å é ® þ ü ú í ó ö « »
á ß ð      ø ¶ ´ ¬ 
 æ  ©   ñ µ ç  ¿ 
]],[[
 ¹   £        ÷ 
 Ä Å É  Þ Ü Ú Í Ó Ö  
Á § Ð      Ø ° ¨ ¦ 
 Æ  ¢   Ñ  Ç   
]],
},["fr-ca"] = {
[[
# 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p ^ ¸ <
a s d f g h j k l ; ` 
 « z x c v b n m , . / 
]],[[
| ! " / $ % ? & * ( ) _ + 
 Q W E R T Y U I O P ^ ¨ >
A S D F G H J K L : ` 
 » Z X C V B N M ' . / 
]],[[
\ ± @ £ ¢ ¤ ¬ ¦ ² ³ ¼ ½ ¾ 
         § ¶ [ ] }
         ~ { 
 °       µ ¯ ­  
]],
nil, 
},["te"] = {
[[
ొ 1 2 3 4 5 6 7 8 9 0 - ృ 
 ౌ ై ా ీ ూ బ హ గ ద జ డ 
ో ే ్ ి ు ప ర క త చ ట 
 ె ం మ న వ ల స , . / 
]],[[
ఒ   ్ర  జ్ఞ త్ర క్ష శ్ర ( ) ః ఋ 
 ఔ ఐ ఆ ఈ ఊ భ ఙ ఘ ధ ఝ ఢ ఞ
ఓ ఏ అ ఇ ఉ ఫ ఱ ఖ థ ఛ ఠ 
 ఎ ఁ ణ న  ళ శ ష  / 
]],[[
 ౧ ౨ ౩ ౪ ౫ ౬ ౭ ౮ ౯ ౦  ౄ 
  ౖ          
 ౕ          
           
]],[[
            ౠ 
    ౡ        
   ఌ        
           
]],
},["hi-2"] = {
[[
ॊ 1 2 3 4 5 6 7 8 9 0 - ृ 
 ौ ै ा ी ू ब ह ग द ज ड ़ ॉ
ो े ् ि ु प र क त च ट 
 ॉ ॆ ं म न व ल स , . / 
]],[[
ऒ ऍ ॅ ्र र् ज्ञ त्र क्ष श्र ( ) ः ऋ 
 औ ऐ आ ई ऊ भ ङ घ ध झ ढ ञ ऑ
ओ ए अ इ उ फ ऱ ख थ छ ठ 
 ऑ ऎ ँ ण ऩ ऴ ळ श ष । / 
]],[[
 १ २ ३ ४ ५ ६ ७ ८ ९ ०  ॄ 
    ॣ    ग़  ज़ ड़  
   ॢ    क़  ॒  
  ॓  ॔     ॰ ॥  
]],[[
            ॠ 
    ॡ       ढ़  
   ऌ  फ़  ख़   ॑ 
   ॐ       ऽ  
]],
},["az-2"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q ü e r t y u i o p ö ğ \
a s d f g h j k l ı ə 
 \ z x c v b n m ç ş / 
]],[[
~ ! " Ⅶ ; % : ? * ( ) _ + 
 Q Ü E R T Y U İ O P Ö Ğ /
A S D F G H J K L I Ə 
 / Z X C V B N M Ç Ş / 
]],
nil, 
nil, 
},["kk"] = {
[[
( " ә і ң ғ , . ү ұ қ ө һ 
 й ц у к е н г ш щ з х ъ \
ф ы в а п р о л д ж э 
 \ я ч с м и т ь б ю № 
]],[[
) ! Ә І Ң Ғ ; : Ү Ұ Қ Ө Һ 
 Й Ц У К Е Н Г Ш Щ З Х Ъ /
Ф Ы В А П Р О Л Д Ж Э 
 | Я Ч С М И Т Ь Б Ю ? 
]],
nil, 
nil, 
},["de-sv"] = {
[[
§ 1 2 3 4 5 6 7 8 9 0 ' ^ 
 q w e r t z u i o p ü ¨
a s d f g h j k l ö ä $ 
 < y x c v b n m , . - 
]],[[
° + " * ç % & / ( ) = ? ` 
 Q W E R T Z U I O P è !
A S D F G H J K L é à £ 
 > Y X C V B N M ; : _ 
]],[[
 ¦ @ # ° § ¬ | ¢   ´ ~ 
   €        [ ]
          { } 
 \           
]],
nil, 
},["el-2"] = {
[[
½ 1 2 3 4 5 6 7 8 9 0 ' ] 
 ; ς ε ρ τ υ θ ι ο π + }
α σ δ φ γ η ξ κ λ ΄ ¨ # 
 < ζ χ ψ ω β ν μ , . - 
]],[[
± ! " £ $ % & / ( ) = ? [ 
 : ~ Ε Ρ Τ Υ Θ Ι Ο Π * {
Α Σ Δ Φ Γ Η Ξ Κ Λ ¨ ΅ @ 
 > Ζ Χ Ψ Ω Β Ν Μ ; : _ 
]],[[
  ² ³ £ § ¶  ¤ ¦ ° ± ½ 
   € ®  ¥     « »
         ΅ ΅ ¬ 
    ©        
]],
nil, 
},["it"] = {
[[
\ 1 2 3 4 5 6 7 8 9 0 ' ì 
 q w e r t y u i o p è +
a s d f g h j k l ò à ù 
 < z x c v b n m , . - 
]],[[
| ! " £ $ % & / ( ) = ? ^ 
 Q W E R T Y U I O P é *
A S D F G H J K L ç ° § 
 > Z X C V B N M ; : _ 
]],[[
     €        
   €        [ ]
         @ #  
            
]],[[
             
           { }
            
            
]],
},["lt-3"] = {
[[
` ! - / ; : , . = ( ) ? x 
 ą ž e r t y u i o p į w q
a s d š g h j k l ų ė 
 < z ū c v b n m č f / 
]],[[
~ 1 2 3 4 5 6 7 8 9 0 + X 
 Ą Ž E R T Y U I O P Į W Q
A S D Š G H J K L Ų Ė 
 > Z Ū C V B N M Č F / 
]],[[
´ @ _ # $ § ^ & * [ ] ' % 
   €        { } |
          " 
 –        „ “  
]],
nil, 
},["sv-2"] = {
[[
§ 1 2 3 4 5 6 7 8 9 0 + ´ 
 q w e r t y u i o p å ¨
a s d f g h j k l ö ä ' 
 < z x c v b n m , . - 
]],[[
½ ! " # ¤ % & / ( ) = ? ` 
 Q W E R T Y U I O P Å ^
A S D F G H J K L Ö Ä * 
 > Z X C V B N M ; : _ 
]],[[
  @ £ $ €  { [ ] } \  
 â  €  ŧ   ï õ   ~
á š đ ǥ ǧ ȟ  ǩ  ø æ  
 | ž  č ǯ ʒ ŋ µ    
]],[[
             
 Â    Ŧ   Ï Õ   
Á Š Đ Ǥ Ǧ Ȟ  Ǩ  Ø Æ  
  Ž  Č Ǯ Ʒ Ŋ     
]],
},["no"] = {
[[
| 1 2 3 4 5 6 7 8 9 0 + \ 
 q w e r t y u i o p å ¨
a s d f g h j k l ø æ ' 
 < z x c v b n m , . - 
]],[[
§ ! " # ¤ % & / ( ) = ? ` 
 Q W E R T Y U I O P Å ^
A S D F G H J K L Ø Æ * 
 > Z X C V B N M ; : _ 
]],[[
  @ £ $ €  { [ ] }  ´ 
   €         ~
            
        µ    
]],
nil, 
},["et"] = {
[[
ˇ 1 2 3 4 5 6 7 8 9 0 + ´ 
 q w e r t y u i o p ü õ '
a s d f g h j k l ö ä 
 < z x c v b n m , . / 
]],[[
~ ! " # ¤ % & / ( ) = ? ` 
 Q W E R T Y U I O P Ü Õ *
A S D F G H J K L Ö Ä 
 > Z X C V B N M ; : / 
]],[[
  @ £ $ €  { [ ] } \  
   €         § ½
 š         ^ 
 | ž          
]],[[
  @ £ $   { [ ] } \  
            § ½
 Š         ^ 
 | Ž          
]],
},["ga"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] #
a s d f g h j k l ; ' 
 \ z x c v b n m , . / 
]],[[
¬ ! " £ $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } ~
A S D F G H J K L : @ 
 | Z X C V B N M < > / 
]],[[
¦    €         
   é    ú í ó    
á          ´ 
            
]],[[
¦             
   É    Ú Í Ó    
Á          ` 
            
]],
},["cs-2"] = {
[[
; + ě š č ř ž ý á í é = ´ 
 q w e r t y u i o p ú ) 
a s d f g h j k l ů § 
 \ z x c v b n m , . / 
]],[[
° 1 2 3 4 5 6 7 8 9 0 % ˇ 
 Q W E R T Y U I O P / ( '
A S D F G H J K L " ! 
 | Z X C V B N M ? : / 
]],[[
` ! @ # $ % ^ & * ( ) - = 
   €        [ ] \
         ; ¤ 
 ß        < >  
]],[[
~           _ + 
           { } |
         : ^ 
 ˝        × ÷  
]],
},["cs"] = {
[[
; + ě š č ř ž ý á í é = ´ 
 q w e r t z u i o p ú ) 
a s d f g h j k l ů § 
 \ y x c v b n m , . / 
]],[[
° 1 2 3 4 5 6 7 8 9 0 % ˇ 
 Q W E R T Z U I O P / ( '
A S D F G H J K L " ! 
 | Y X C V B N M ? : / 
]],[[
 ~ ˇ ^ ˘ ° ˛ ` ˙ ´ ˝ ¨ ¸ 
 \ | €        ÷ × ¤
 đ Đ [ ]   ł Ł $ ß 
   # & @ { }  < >  
]],
nil, 
},["cs-3"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] \
a s d f g h j k l ; ' 
 \ z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } |
A S D F G H J K L : " 
 | Z X C V B N M < > / 
]],[[
; + ě š č ř ž ý á í é = ´ 
   €        ú ) 
         ů § 
 ß        ? :  
]],[[
°           % ˇ 
           / ( 
         " ! 
 ˝        × ÷  
]],
},["sr-2"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 ' + 
 љ њ е р т з у и о п ш ђ ж
а с д ф г х ј к л ч ћ 
 < ѕ џ ц в б н м , . / 
]],[[
~ ! " # $ % & / ( ) = ? * 
 Љ Њ Е Р Т З У И О П Ш Ђ Ж
А С Д Ф Г Х Ј К Л Ч Ћ 
 > Ѕ Џ Ц В Б Н М ; : / 
]],[[
             
   €          
           
         < >  
]],
nil, 
},["es-3"] = {
[[
' 1 2 3 4 5 6 7 8 9 0 - ¨ 
 q w e r t y u i o p ÷ `
a s d f g h j k l ñ ç ´ 
 < z x c v b n m , . = 
]],[[
· ª " / ( ) ¡ ! ¿ ? ₧ + ¨ 
 Q W E R T Y U I O P × `
A S D F G H J K L Ñ Ç ´ 
 > Z X C V B N M ; : % 
]],[[
\ | @ # ¼ ½ ¬ _ # § \ * ~ 
   €        [ ]
$ & @ [ ] | £ ±  ~ { } 
          ^  
]],
nil, 
},["pt"] = {
[[
\ 1 2 3 4 5 6 7 8 9 0 ' « 
 q w e r t y u i o p + ´
a s d f g h j k l ç º ~ 
 < z x c v b n m , . - 
]],[[
| ! " # $ % & / ( ) = ? » 
 Q W E R T Y U I O P * `
A S D F G H J K L Ç ª ^ 
 > Z X C V B N M ; : _ 
]],[[
  @ £ § €  { [ ] }   
   €        ¨ ]
            
            
]],
nil, 
},["mt"] = {
[[
ċ 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p ġ ħ ż
a s d f g h j k l ; ' 
 z x c v b n m , . / 
]],[[
Ċ ! @ € $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P Ġ Ħ Ż
A S D F G H J K L : " 
 Z X C V B N M < > / 
]],[[
`   £          
   è    ù ì ò  [ ] \
à           
           
]],[[
~             
   È    Ù Ì Ò  { } |
À           
           
]],
},["ka-2"] = {
[[
„ ! № , ; % : ? . ( ) - “ 
 ჩ პ უ ძ ჭ ტ თ ნ ვ შ კ ქ /
ხ ი ა ე ო დ მ ს რ ბ გ 
 \ ჯ ჰ ყ ღ ჟ ზ ც ლ ფ / 
]],[[
' 1 2 3 4 5 6 7 8 9 0 + = 
             §
           
 /          / 
]],[[
` ! @ # $ € ^ & * ( ) — = 
        ჼ ჳ  [ ] \
ჴ ჲ ჺ ჱ       ჹ 
   ჵ ჸ ჷ     ჶ  
]],[[
~   §     ° « » _  
        I   { } |
  D      L  " 
   X C V   M < >  
]],
},["si-2"] = {
[[
්ර 1 2 3 4 5 6 7 8 9 0 - = 
 ු අ ැ ර එ හ ම ස ද ච ඤ ; ්
් ි ා ෙ ට ය ව න ක ත . 
 ' ං ජ ඩ ඉ බ ප ල ග / 
]],[[
ර් ! @ # $ % ^ & * ( ) _ + 
 ූ උ ෑ ඍ ඔ ශ ඹ ෂ ධ ඡ ඥ : 
ෟ ී ෘ ෆ ඨ ්ය ළු ණ ඛ ථ , 
 " ඃ ඣ ඪ ඊ භ ඵ ළ ඝ / 
]],[[
` ¡ ² ³ ¤ € ¼ ½ ¾ ‘ ’ ¥ × 
 ෞ ො ෛ ේ     ඳ  [ ] \
ෳ ෝ         ෴ 
  ඞ ඦ ඬ    ඏ ඟ  
]],[[
~ ¹   £        ÷ 
           { } |
           
        < >  
]],
},["lt"] = {
[[
` ą č ę ė į š ų ū 9 0 - ž 
 q w e r t y u i o p [ ] \
a s d f g h j k l ; ' 
 \ z x c v b n m , . / 
]],[[
~ Ą Č Ę Ė Į Š Ų Ū ( ) _ Ž 
 Q W E R T Y U I O P { } |
A S D F G H J K L : " 
 | Z X C V B N M < > / 
]],[[
 1 2 3 4 5 6 7 8 9 0  = 
   €          
           
            
]],[[
 ! @ # $ % ^ & *    + 
             
           
            
]],
},["sl"] = {
[[
¸ 1 2 3 4 5 6 7 8 9 0 ' + 
 q w e r t z u i o p š đ ž
a s d f g h j k l č ć 
 < y x c v b n m , . / 
]],[[
¨ ! " # $ % & / ( ) = ? * 
 Q W E R T Z U I O P Š Đ Ž
A S D F G H J K L Č Ć 
 > Y X C V B N M ; : / 
]],[[
 ~ ˇ ^ ˘ ° ˛ ` ˙ ´ ˝ ¨ ¸ 
 \ | €        ÷ × ¤
   [ ]   ł Ł  ß 
     @ { } § < >  
]],
nil, 
},["se-2"] = {
[[
| 1 2 3 4 5 6 7 8 9 0 + \ 
 á š e r t ŧ u i o p å ŋ đ
a s d f g h j k l ø æ 
 ž z č c v b n m , . / 
]],[[
§ ! " # ¤ % & / ( ) = ? ` 
 Á Š E R T Ŧ U I O P Å Ŋ Đ
A S D F G H J K L Ø Æ 
 Ž Z Č C V B N M ; : / 
]],[[
  @ £ $ €  { [ ] }  ´ 
 q w €   y  ï õ  ¨ ~ '
â    ǧ ǥ  ǩ  ö ä 
 ǯ ʒ x     µ < >  
]],[[
             
 Q W    Y  Ï Õ  ^ ˇ *
Â    Ǧ Ǥ  Ǩ  Ö Ä 
 Ǯ Ʒ X         
]],
},["se"] = {
[[
§ 1 2 3 4 5 6 7 8 9 0 + ´ 
 á š e r t ŧ u i o p å ŋ đ
a s d f g h j k l ö ä 
 ž z č c v b n m , . / 
]],[[
½ ! " # ¤ % & / ( ) = ? ` 
 Á Š E R T Ŧ U I O P Å Ŋ Đ
A S D F G H J K L Ö Ä 
 Ž Z Č C V B N M ; : / 
]],[[
|  @ £ $ €  { [ ] } \  
 q w €   y  ï õ  ¨ ~ '
â    ǧ ǥ  ǩ  ø æ 
 ǯ ʒ x     µ < >  
]],[[
             
 Q W    Y  Ï Õ  ^ ˇ *
Â    Ǧ Ǥ  Ǩ  Ø Æ 
 Ǯ Ʒ X         
]],
},["fr-ca-2"] = {
[[
° 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p ^ ç à
a s d f g h j k l ; è 
 ù z x c v b n m , . / 
]],[[
° ! " # $ % ? & * ( ) _ + 
 Q W E R T Y U I O P ^ Ç À
A S D F G H J K L : È 
 Ù Z X C V B N M ' . / 
]],[[
¬ ¹ @ ³ ¼ ½ ¾ { [ ] } | ¸ 
    ¶  ¥   ø þ ° ~ 
æ ß ð ª      ´  
 \ « » ¢    µ < >  
]],[[
 ¡ ² £ ¤     ±  ¿  
    ®     Ø Þ  ¨ 
Æ § Ð       ´  
 |   ©    º    
]],
},["sq"] = {
[[
\ 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t z u i o p ç @
a s d f g h j k l ë [ ] 
 < y x c v b n m , . / 
]],[[
| ! " # $ % ^ & * ( ) _ + 
 Q W E R T Z U I O P Ç '
A S D F G H J K L Ë { } 
 > Y X C V B N M ; : ? 
]],[[
 ~ ˇ ^ ˘ ° ˛ ` ˙ ´ ˝ ¨ ¸ 
 \ |         ÷ ×
 đ Đ [ ]   ł Ł $ ß ¤ 
     @ { } § < >  
]],
nil, 
},["nl-fr-fr"] = {
[[
² & é " ' ( § è ! ç à ) - 
 a z e r t y u i o p ^ $ µ
q s d f g h j k l m ù 
 < w x c v b n , ; : / 
]],[[
³ 1 2 3 4 5 6 7 8 9 0 ° _ 
 A Z E R T Y U I O P ¨ * £
Q S D F G H J K L M % 
 > W X C V B N ? . / / 
]],[[
 | @ # { [ ^   { }   
   €        [ ] 
          ´ 
 \           
]],
nil, 
},["gd"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ]
a s d f g h j k l ; ' # 
 \ z x c v b n m , . / 
]],[[
` ! " £ $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { }
A S D F G H J K L : @ ~ 
 | Z X C V B N M < > ? 
]],[[
¦    €         
   é   ý ú í ó   
á          '  
            
]],[[
¬             
   É   Ý Ú Í Ó   
Á            
            
]],
},["nl"] = {
[[
@ 1 2 3 4 5 6 7 8 9 0 / ° 
 q w e r t y u i o p ¨ * 
a s d f g h j k l + ´ < 
 ] z x c v b n m , . - 
]],[[
§ ! " # $ % & _ ( ) ' ? ~ 
 Q W E R T Y U I O P ^ | 
A S D F G H J K L ± ` > 
 [ Z X C V B N M ; : = 
]],[[
¬ ¹ ² ³ ¼ ½ ¾ £ { }  \ ¸ 
   € ¶         
 ß           
 ¦ « » ¢    µ  ·  
]],
nil, 
},["kl"] = {
[[
½ 1 2 3 4 5 6 7 8 9 0 + ´ 
 q w e r t y u i o p å ¨ '
a s d f g h j k l æ ø 
 < z x c v b n m , . / 
]],[[
§ ! " # ¤ % & / ( ) = ? ` 
 Q W E R T Y U I O P Å ^ *
A S D F G H J K L Æ Ø 
 > Z X C V B N M ; : / 
]],[[
  @ £ $ €  { [ ] }  | 
   €       þ  ~ 
 ß ð     ĸ    
 \       µ    
]],[[
             
          Þ   
  Ð         
            
]],
},["sah"] = {
[[
" ! нь дь ҥ ҕ ө һ ү ; : - = 
 й ц у к е н г ш щ з х ъ \
ф ы в а п р о л д ж э 
 " я ч с м и т ь б ю / 
]],[[
№ ? Нь Дь Ҥ Ҕ Ө Һ Ү ( ) _ + 
 Й Ц У К Е Н Г Ш Щ З Х Ъ /
Ф Ы В А П Р О Л Д Ж Э 
 № Я Ч С М И Т Ь Б Ю / 
]],
nil, 
nil, 
},["th-4"] = {
[[
_ = ๒ ๓ ๔ ๕ ู ๗ ๘ ๙ ๐ ๑ ๖ 
 ็ ต ย อ ร ่ ด ม ว แ ใ ฌ 
้ ท ง ก ั ี า น เ ไ ข 
 บ ป ล ห ิ ค ส ะ จ พ 
]],[[
฿ + " / , ? ุ _ . ( ) - % 
 ๊ ฤ ๆ ญ ษ ึ ฝ ซ ถ ฒ ฯ ฦ ํ
๋ ธ ำ ณ ์ ื ผ ช โ ฆ ฑ 
 ฎ ฏ ฐ ภ ั ศ ฮ ฟ ฉ ฬ 
]],
nil, 
nil, 
},["pl"] = {
[[
˛ 1 2 3 4 5 6 7 8 9 0 + ' 
 q w e r t z u i o p ż ś
a s d f g h j k l ł ą ó 
 < y x c v b n m , . - 
]],[[
· ! " # ¤ % & / ( ) = ? * 
 Q W E R T Z U I O P ń ć
A S D F G H J K L Ł ę ź 
 > Y X C V B N M ; : _ 
]],[[
 ~ ˇ ^ ˘ ° ˛ ` · ´ ˝ ¨ ¸ 
 \ ¦     €    ÷ ×
 đ Đ       $ ß  
     @ { } § < >  
]],
nil, 
},["hu-2"] = {
[[
í 1 2 3 4 5 6 7 8 9 ö ü ó 
 q w e r t y u i o p ő ú
a s d f g h j k l é á ű 
 í z x c v b n m , . - 
]],[[
Í ' " + ! % / = ( ) Ö Ü Ó 
 Q W E R T Y U I O P Ő Ú
A S D F G H J K L É Á Ű 
 Í Z X C V B N M ? : _ 
]],[[
0 ~ ˇ ^ ˘ ° ˛ ` ˙ ´ ˝   
 \ | Ä § ¤  € Í   ÷ ×
ä đ Đ [ ]  í ł Ł $ ß \ 
 < > # & @ { } < ; > * 
]],
nil, 
},["ml"] = {
[[
ൊ 1 2 3 4 5 6 7 8 9 0 - ൃ 
 ൌ ൈ ാ ീ ൂ ബ ഹ ഗ ദ ജ ഡ 
ോ േ ് ി ു പ ര ക ത ച ട 
 െ ം മ ന വ ല സ , . / 
]],[[
ഒ   ്ര    ക്ഷ  ( ) ഃ ഋ 
 ഔ ഐ ആ ഈ ഊ ഭ ങ ഘ ധ ഝ ഢ ഞ
ഓ ഏ അ ഇ ഉ ഫ റ ഖ ഥ ഛ ഠ 
 എ  ണ  ഴ ള ശ ഷ  / 
]],[[
 ൧ ൨ ൩ ൪ ൫ ൬ ൭ ൮ ൯ ൦   
 ൗ           
           
           
]],[[
            ൠ 
    ൡ        
  ഌ         
           
]],
},["el"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 ; ς ε ρ τ υ θ ι ο π [ ]
α σ δ φ γ η ξ κ λ ΄ ' \ 
 < ζ χ ψ ω β ν μ , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 : ΅ Ε Ρ Τ Υ Θ Ι Ο Π { }
Α Σ Δ Φ Γ Η Ξ Κ Λ ¨ " | 
 > Ζ Χ Ψ Ω Β Ν Μ < > ? 
]],[[
  ² ³ £ § ¶  ¤ ¦ ° ± ½ 
   € ®  ¥     « »
         ΅  ¬ 
    ©        
]],
nil, 
},["lv-2"] = {
[[
` 1 2 3 4 5 6 7 8 9 0 - = 
 q w e r t y u i o p [ ] 
a s d f g h j k l ; ' 
 \ z x c v b n m , . / 
]],[[
~ ! @ # $ % ^ & * ( ) _ + 
 Q W E R T Y U I O P { } |
A S D F G H J K L : " 
 | Z X C V B N M < > / 
]],[[
­  « » €  ’     –  
   ē ŗ   ū ī õ    
ā š   ģ   ķ ļ  ´ 
  ž  č   ņ     
]],[[
    § °  ± ×   —  
   Ē Ŗ   Ū Ī Õ    
Ā Š   Ģ   Ķ Ļ  ¨ 
  Ž  Č   Ņ     
]],
},
}